nsaspook/pic32a_fe/src/is66.c
/*
 * is66 setup and R/W functions
 */
#include <xc.h>
#include <stddef.h>                     // Defines NULL
#include <stdbool.h>                    // Defines true
#include <stdlib.h>                     // Defines EXIT_FAILURE
#include <ctype.h>
#include <stdio.h>
#include <string.h>
#include "definitions.h"                // SYS function prototypes

//#define USE_SRAM
//#define DMA_HALF

volatile uint8_t iss_adc_write[8] = {0x02, 0x00, 0x00, 0x00}; // 1024 bytes in each address page for sequential writes
uint8_t sram_adc_write[8];
volatile uint32_t adc_result = 0;

/*
 * setup the iss66 command buffer and DMA the data to the chip
 */
void ADC_DMA_write(void)
{
	TP0_Set(); // timing GPIO trace
#ifndef USE_SRAM
	SRAM_CS_Clear();
#endif

#ifndef USE_SRAM
	TP0_Clear();
	TP0_Set();
	AD1SWTRGbits.CH6TRG = 1;
	while (AD1STATbits.CH6RDY == 0);
	TP0_Clear();
	TP0_Set();
	adc_result = AD1CH6DATA;
	memcpy((void *) &iss_adc_write[4], (const void *) &adc_result, 4);
	iss_adc_write[3]++; // write 256 bytes into chip sram

	while (DMA_ChannelIsBusy(DMA_CHANNEL_5)) {
	};
	DMA_ChannelTransfer(DMA_CHANNEL_5, (const void *) iss_adc_write, (const void*) &SPI2BUF, (size_t) 6);
#endif

#ifndef USE_SRAM
	SRAM_CS_Set();
#endif
	TP0_Clear();
};

/*
 * iss66 data reads using DMA
 * on the todo list
 */
void ADC_DMA_read(void)
{

};

/*
 * DMA event callback processor
 * not being used, only for testing for now
 */
void SPI2DmaChannelHandler_State(DMA_TRANSFER_EVENT event, uintptr_t contextHandle)
{
#ifdef DMA_HALF
	if (event == DMA_TRANSFER_EVENT_HALF_COMPLETE) {
		adc_result = AD1CH6DATA;
		AD1SWTRGbits.CH6TRG = 1;
		while (AD1STATbits.CH6RDY == 0);
	}
#endif
}

/*
 * Time trigger for ADC conversion and iss66 data writes
 */
void SCCP2_Callback_InterruptHandler(uint32_t status, uintptr_t context)
{
	ADC_DMA_write();
}

void ADC_DMA_init(void)
{
	// Select single conversion mode on channel 6 to AN6
	AD1CH6CONbits.MODE = 0;
	// Software trigger will start a conversion.
	AD1CH6CONbits.TRG1SRC = 1;
	AD1CH6CONbits.TRG2SRC = 0;
	// Use a single-ended input.
	AD1CH6CONbits.DIFF = 0;
	// Select the AN6 analog positive input/pin for the signal.
	AD1CH6CONbits.PINSEL = 6;
	// Select signal sampling time (0.5 TADs = 6.25nS).
	AD1CH6CONbits.SAMC = 0;
	// Set ADC to RUN mode.
	AD1CONbits.MODE = 2;
	// Enable ADC.
	AD1CONbits.ON = 1;
	// Wait when ADC will be ready/calibrated.
	while (AD1CONbits.ADRDY == 0);

	// Trigger channel #6 in software and wait for the result.
	AD1SWTRGbits.CH6TRG = 1;
	// Wait for a conversion ready flag.
	while (AD1STATbits.CH6RDY == 0);
	// Read result. It will clear the conversion ready flag.
	adc_result = AD1CH6DATA;

	/*
	 * setup the DMA and timer background tasks
	 */
	DMA_ChannelCallbackRegister(DMA_CHANNEL_5, SPI2DmaChannelHandler_State, 0);
	SCCP2_TimerCallbackRegister(SCCP2_Callback_InterruptHandler, (uintptr_t) NULL);
	SCCP2_Timer32bitPeriodSet(350); // 3.5us timer interrupts

}